{"id":14,"date":"2021-05-27T21:00:48","date_gmt":"2021-05-27T21:00:48","guid":{"rendered":"http:\/\/redgranite.github.io\/?page_id=14"},"modified":"2021-06-28T17:27:13","modified_gmt":"2021-06-28T17:27:13","slug":"about-us","status":"publish","type":"page","link":"http:\/\/redgranite.github.io\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"\n<div style=\"height:10px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2><strong>About Us<\/strong><\/h2>\n\n\n<div class='w3eden'><!-- WPDM Link Template: Default Template -->\n\n\n<div class=\"link-template-default card mb-2\">\n    <div class=\"card-body\">\n        <div class=\"media stack-xs\">\n            <div class=\"media-body\">\n                <div class=\"media\">\n                    <div class=\"mr-3 img-48\"><img class=\"wpdm_icon\" alt=\"Icon\"   src=\"http:\/\/redgranite.github.io\/wp-content\/plugins\/download-manager\/assets\/file-type-icons\/pdf.svg\" \/><\/div>\n                    <div class=\"media-body\">\n                        <h3 class=\"package-title\"><a href='http:\/\/redgranite.github.io\/download\/pote-holdings-profile\/'>Red Granite Investments Profile<\/a><\/h3>\n                        <div class=\"text-muted text-small\"><i class=\"fas fa-copy\"><\/i> 1 file(s) <i class=\"fas fa-hdd ml-3\"><\/i> 1.33 MB<\/div>\n                    <\/div>\n                <\/div>\n            <\/div>\n            <div class=\"ml-3 wpdmdl-btn\">\n                <a class='wpdm-download-link download-on-click btn btn-danger btn-lg' rel='nofollow' href='#' data-downloadurl=\"http:\/\/redgranite.github.io\/download\/pote-holdings-profile\/?wpdmdl=127&refresh=60db0999d36fb1624967577\">Download<\/a>\n            <\/div>\n        <\/div>\n    <\/div>\n<\/div>\n\n\n<\/div>\n\n\n\n<p>Red Granite Investments is a company of strategic business units in gold milling and quarry. Our success is driven by our people and their unrelenting focus on delivering results the right way by operating responsibly, executing with excellence and capturing new opportunities for profitable growth.<\/p>\n\n\n\n<p><strong>VISION<\/strong><\/p>\n\n\n\n<p>Red Granite Investments strives to be the leading supplier through professional service, competitive prices and high success rates to its customers.<\/p>\n\n\n\n<p>We aim to be the premier leader in the industry through our commitment to continuous innovation in answering the unique needs of every customer.<\/p>\n\n\n\n<p><strong>MISSION<\/strong><\/p>\n\n\n\n<p>The company envisages providing its product range at very competitive prices, ensuring that the high success rates are maintained and further business expansion in the foreseeable future through total customer satisfaction.<\/p>\n\n\n\n<p>We are committed to providing reliable and professional services to our valuable customers, and to be supportive to local business and social activities, to be one of the top branded product and service providers and continue to remain top of the range whilst being friendly as well as contributing to the socio economic environment within which we operate.<\/p>\n\n\n\n<p><strong>ORGANISATION STRUCTURE<\/strong><\/p>\n\n\n\n<p>The company is headed by three Directors supported by one Operations Director. The Directors are supported by 2 General Managers who have 10 Line Managers under them. The Line Managers are in charge of more than 800 employees ranging from technicians, till operators, shelf packers, security guards, loaders, drivers, stock controllers, bookkeepers etc.<\/p>\n\n\n\n<p>Customer satisfaction is crucial to the success of our business and we achieve this by tasking professional and qualified staff for any job we do for our clients.<\/p>\n\n\n\n<p><strong>EXCELLENCE<\/strong><\/p>\n\n\n\n<p>We are driven by a sense of pride to meet the highest standards in product delivery. We take initiative and strive for continuous quality improvement. We believe that the passion to learn and grow is the key to excellence and success. We are committed to pursuing our goals with enthusiasm, a relentless and purposeful sense of urgency and winner’s attitude.<\/p>\n\n\n\n<p><strong>INTEGRITY<\/strong><\/p>\n\n\n\n<p>We are honest and ethical in all our dealings with customers and with each other. We work to build trust with one another and strictly comply to the laws governing our business, not only as a legal obligation but because it is the right thing to do.<\/p>\n\n\n\n<p><strong>INNOVATION<\/strong><\/p>\n\n\n\n<p>We are constantly seeking a leading edge by providing products and services that add value to our customers. We support the creativity, strategic thinking and persistence of our workers in developing solutions.<\/p>\n\n\n\n<p><strong>ACCOUNTABILITY<\/strong><\/p>\n\n\n\n<p>As a company we take full responsibility for our performance and take ownership of our products and services.<\/p>\n\n\n\n<p><strong>TEAMWORK<\/strong><\/p>\n\n\n\n<p>We believe in collaboration effort. We have collaborated with other players in the industry through sub contracting and being sub contracted for certain services. We achieve excellence by putting collective goals ahead of personal interests. We motivate, encourage one another and support meaningful cooperation among colleagues from varying backgrounds and disciplines. We respect individual differences and share knowledge.<\/p>\n\n\n\n<p><strong>RESPECT<\/strong><\/p>\n\n\n\n<p>We believe in the dignity, worth and creative potential of our staff. We recognize the need for work-life balance and treat all employees fairly and consistently. We reward and recognize achievement, value expertise, and actively seek employees’ involvement and contributions. We invest in personal growth and development and offer our employees an environment where all can make an impact and find fulfilment.<\/p>\n\n\n\n<p><strong>LEADERSHIP<\/strong><\/p>\n\n\n\n<p>We are, in the foreseeable future, the leading company in product and service delivery in the Southern Regions of Zimbabwe. We continuously strive to be the best in what we do, both as a company and as individuals. We embrace the qualities of personal leadership, competence, confidence and passion to surpassing expectations, and inspire others to do the same. We provide customers with the highest quality products and services.<\/p>\n\n\n\n<p><strong>SIGNIFICANT DEVELOPMENTS<\/strong><\/p>\n\n\n\n<p>We are now a major player in the industry. We have taken a significant share of the market, not only in Zvishavane district but surrounding regions as well. This is evidenced by our supplies in Masvingo, Gweru, Shurugwi, Chiredzi and Mberengwa.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>About Us Red Granite Investments is a company of strategic business units in gold milling and quarry. Our success is driven by our people and their unrelenting focus on delivering results the right way by operating responsibly, executing with excellence and capturing new opportunities for profitable growth. VISION Red Granite Investments strives to be the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/template-full-width.php","meta":[],"featured_image_urls":{"full":"","thumbnail":"","medium":"","medium_large":"","large":"","1536x1536":"","2048x2048":"","post-thumbnail":"","twentytwenty-fullscreen":""},"post_excerpt_stackable":"<p>About Us Red Granite Investments Profile 1 file(s) 1.33 MB Download Red Granite Investments is a company of strategic business units in gold milling and quarry. Our success is driven by our people and their unrelenting focus on delivering results the right way by operating responsibly, executing with excellence and capturing new opportunities for profitable growth. VISION Red Granite Investments strives to be the leading supplier through professional service, competitive prices and high success rates to its customers. We aim to be the premier leader in the industry through our commitment to continuous innovation in answering the unique needs of&hellip;<\/p>\n","category_list":"","author_info":{"name":"admin","url":"http:\/\/redgranite.github.io\/author\/admin\/"},"comments_num":"0 comments","_links":{"self":[{"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/pages\/14"}],"collection":[{"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/comments?post=14"}],"version-history":[{"count":6,"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/pages\/14\/revisions"}],"predecessor-version":[{"id":479,"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/pages\/14\/revisions\/479"}],"wp:attachment":[{"href":"http:\/\/redgranite.github.io\/wp-json\/wp\/v2\/media?parent=14"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}